app/views/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 17], ["id", 16]]
---
          <p>
            <strong>  <%= comment.user.first_name %></strong>