app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 40]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 17]]
---
      <br>
        <small class="d-flex"><a class='mr-3'><%= post.likes.count %> <%= ( post.likes.count ) == 1 ? 'Like' : 'Likes' %></a>
      <% like = post.likes.find { |like| like.user_id == current_user.id} %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 40]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 17], ["id", 16]]
---
</div>
    <%= render post.comments.includes(:user) %>