app/views/posts/index.html.erb

<tbody>
<% current_user.user_friends_post.each do |post| %>
 <tr>
  <td>author: <%= post.user.first_name %> Post: <%= post.content%></td>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        data: { confirm: "Are you sure you want to delete this post"} %></td>
        <td><p><%= post.likes.count %> <%= ( post.likes.count ) == 1 ? 'Like' : 'Likes' %></p> </td>
 <td><% post.comments.each do |comment| %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]