app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hello"], ["created_at", "2020-04-24 22:08:15.754975"], ["updated_at", "2020-04-24 22:08:15.754975"], ["user_id", 3], ["post_id", 1]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id
    if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find(params[:post_id])