app/controllers/friendships_controller.rb

  def create

    if @user_one !=  @friend
      is_friendship = current_user.friendships.exists?(friend: @friend)
      if !is_friendship
        current_user.friendships.create(friend: @friend, status: 'pending')
        @friend.friendships.create(friend: @user_one, status: 'requested')
        flash[:success] = "Friend request has been sent to #{@friend.first_name} #{@friend.last_name}."
---
SELECT 1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["friend_id", 2], ["created_at", "2020-04-21 22:16:36.416531"], ["updated_at", "2020-04-21 22:16:36.416531"], ["status", "pending"]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", "2020-04-21 22:16:36.441106"], ["updated_at", "2020-04-21 22:16:36.441106"], ["status", "requested"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" IS NULL AND "friendships"."friend_id" = $1  [["friend_id", 19]]

  def find_user
    @user_one = current_user
    @friend = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]