app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 17]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 17], ["id", 16]]
---
  def index
    @posts = Post.all.order('created_at DESC').includes(:user)

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "<p>Hello am coming</p>"], ["user_id", 3], ["created_at", "2020-04-24 22:07:35.887892"], ["updated_at", "2020-04-24 22:07:35.887892"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2020-04-24 22:07:36.921977"], ["id", 1]]
---
  def update
    if @post.update(post_params)