app/models/friendship.rb

DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 86]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 49]]
---
  def self.breakup(user, friend)
    transaction do
      find_by_user_id_and_friend_id(user, friend).destroy
      find_by_user_id_and_friend_id(friend, user).destroy

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
UPDATE "friendships" SET "status" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["status", "accepted"], ["updated_at", "2020-04-21 22:12:58.869259"], ["id", 61]]
UPDATE "friendships" SET "updated_at" = $1 WHERE "friendships"."id" = $2  [["updated_at", "2020-04-21 22:12:58.846239"], ["id", 61]]
---
  def self.accept_one_side(user, friend, updated_at)
    request = self.where(user_id: user,friend_id: friend)
    request.update(status:'accepted')
    request.update(updated_at:updated_at)