app/models/friendship.rb

  def self.accept_one_side(user, friend, updated_at)
    request = find_by_user_id_and_friend_id(user, friend)
    request.status = 'accepted'
    request.updated_at = updated_at
    request.save!
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["friend_id", 5], ["created_at", "2020-03-11 10:54:22.240772"], ["updated_at", "2020-03-11 10:54:22.240772"], ["status", "requested"]]