app/models/user.rb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["post_id", 40], ["post_id", 38], ["post_id", 37], ["post_id", 36], ["post_id", 35], ["post_id", 34], ["post_id", 33], ["post_id", 21], ["post_id", 20]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 17]]
---
  def user_friends_post
    Post.where(user_id: self).includes([:user]).order('created_at DESC').includes([:image_attachment]).includes([:likes]) + Post.where(user_id: friends).includes([:user]).order('created_at DESC').includes([:image_attachment]).includes([:likes])